Tekla.Structures.AnalysisInternal.DotAnalysisDesignCode
The serialization structure for AnalysisDesignCode.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignCode.name
The name of the analysis design code.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignCode.id
The identifier of the analysis design code.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignCode.materialType
The material type of the analysis design code.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignCode.ToStruct(Tekla.Structures.Analysis.AnalysisDesignCode)
DO NOT USE! For internal usage only!
analysisDesignCode:
The source analysis design code

Tekla.Structures.AnalysisInternal.DotAnalysisDesignCode.FromStruct(Tekla.Structures.Analysis.AnalysisDesignCode)
DO NOT USE! For internal usage only!
analysisDesignCode:
The target analysis design code